src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодотчётноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрайсЛиста</name>
    <type>
      <types>EnumRef.ПрайсЛистТовара</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмерения</name>
      <type>
        <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньБрака</name>
      <type>
        <types>CatalogRef.СтепениБрака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПроверкаВеденияУчётаСклада(ВыбранноеЗначение);
    УчётСкладаВедётся = ВыбранноеЗначение;
	Элементы.Склад.Видимость = ?(УчётСкладаВедётся, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрайсЛистаПриИзменении(Элемент)
	
	ДоступностьТЧ = ЗначениеЗаполнено(Объект.ТипПрайсЛиста);
	Элементы.Товары.Доступность = ДоступностьТЧ;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
    ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(ВыбранноеЗначение, Объект.ТипПрайсЛиста);	
	
	ТекДанные.Цена 		  = ДанныеНоменклатуры.Цена;
	ТекДанные.ЕдИзмерения = ДанныеНоменклатуры.ЕдИзмеренеия;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
    ТекДанные 		= Элементы.Товары.ТекущиеДанные;	
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыБракПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные; 
	
	Элементы.ТоварыСтепеньБрака.Доступность = ТекДанные.Брак;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПроверкаВеденияУчётаСклада(Организация)
		Возврат РаботаСДокументамиСервер.ВедётЛиОрганизацияУчётСклада(Организация);
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(Номенклатура, ТипПрайсЛиста)
	Возврат РаботаСДокументамиСервер.ПолучитьДанныеНоменклатуры(Номенклатура, ТипПрайсЛиста);	
КонецФункции

#КонецОбласти
